// конфигурация

var config = {
	movie : [true, 62465], // id произведения +
	imax : true, // скрывать не IMAX-сеансы +
	search : [true, 1], // отображать строку поиска по кинотеатрам +- // без позиции
	schedule : true, // отображать расписание
	header : true, // отображать заголовок +
	footer : true, // отображать футер +
	map : [true, 2, 9], // отображать карту, позиция дива, zoom +- // без позиции
	blocks : true, // отображать кастомные блоки

	mainCss : true // исполльзовать css основного сайта +
}